Swarm-OS/Swarm-OS-MCAL/mcal/stm32/stm32f1xx/sfr.h
#ifndef MCAL_SFR_H
#define MCAL_SFR_H

#include "mcu_datatypes.h"

#define _MMIO_BYTE(mem_addr) (*(volatile uint8_t *)(mem_addr))
#define _MMIO_HWORD(mem_addr) (*(volatile uint16_t *)(mem_addr))
#define _MMIO_WORD(mem_addr) (*(volatile uint32_t *)(mem_addr))



#define _MMIO_ADDR_CRC      0x40023000
#define _MMIO_ADDR_PWR      0x40007000
#define _MMIO_ADDR_BKP      0x40006C00
#define _MMIO_ADDR_RCC      0x40021000 


#define _MMIO_ADDR_GPIOA 0x40010800 
#define GPIOA_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x00)
#define GPIOA_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x04)
#define GPIOA_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x08)
#define GPIOA_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x0C)
#define GPIOA_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x10)
#define GPIOA_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x14)
#define GPIOA_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOA + 0x18)

#define _MMIO_ADDR_GPIOB 0x40010C00
#define GPIOB_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x00)
#define GPIOB_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x04)
#define GPIOB_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x08)
#define GPIOB_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x0C)
#define GPIOB_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x10)
#define GPIOB_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x14)
#define GPIOB_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOB + 0x18)

#define _MMIO_ADDR_GPIOC 0x40011000
#define GPIOC_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x00)
#define GPIOC_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x04)
#define GPIOC_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x08)
#define GPIOC_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x0C)
#define GPIOC_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x10)
#define GPIOC_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x14)
#define GPIOC_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOC + 0x18)

#define _MMIO_ADDR_GPIOD 0x40011400
#define GPIOD_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x00)
#define GPIOD_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x04)
#define GPIOD_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x08)
#define GPIOD_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x0C)
#define GPIOD_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x10)
#define GPIOD_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x14)
#define GPIOD_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOD + 0x18)

#define _MMIO_ADDR_GPIOE 0x40011800
#define GPIOE_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x00)
#define GPIOE_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x04)
#define GPIOE_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x08)
#define GPIOE_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x0C)
#define GPIOE_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x10)
#define GPIOE_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x14)
#define GPIOE_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOE + 0x18)

#define _MMIO_ADDR_GPIOF 0x40011C00 
#define GPIOF_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x00)
#define GPIOF_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x04)
#define GPIOF_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x08)
#define GPIOF_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x0C)
#define GPIOF_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x10)
#define GPIOF_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x14)
#define GPIOF_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOF + 0x18)

#define _MMIO_ADDR_GPIOG 0x40012000
#define GPIOG_CRL   _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x00)
#define GPIOG_CRH   _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x04)
#define GPIOG_IDR   _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x08)
#define GPIOG_ODR   _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x0C)
#define GPIOG_BSRR  _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x10)
#define GPIOG_BRR   _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x14)
#define GPIOG_LCKR  _MMIO_WORD(_MMIO_ADDR_GPIOG + 0x18)

#define _MMIO_ADDR_AFIO     0x40010000

#define _MMIO_ADDR_EXTI     0x40010400

#define _MMIO_ADDR_ADC1     0x40012400
#define _MMIO_ADDR_ADC2     0x40012800
#define _MMIO_ADDR_ADC3     0x40013C00

#define _MMIO_ADDR_DAC      0x40007400

#define _MMIO_ADDR_DMA1     0x40020000
#define _MMIO_ADDR_DMA2     0x40020400

#define _MMIO_ADDR_TIM1     0x40012C00
#define _MMIO_ADDR_TIM8     0x40013400

#define _MMIO_ADDR_TIM2     0x40000000
#define _MMIO_ADDR_TIM3     0x40000400
#define _MMIO_ADDR_TIM4     0x40000800
#define _MMIO_ADDR_TIM5     0x40000C00

#define _MMIO_ADDR_TIM6     0x40001000
#define _MMIO_ADDR_TIM7     0x40001400

#define _MMIO_ADDR_TIM9     0x40014C00
#define _MMIO_ADDR_TIM10    0x40015000 
#define _MMIO_ADDR_TIM11    0x40015400
#define _MMIO_ADDR_TIM12    0x40001800
#define _MMIO_ADDR_TIM13    0x40001C00
#define _MMIO_ADDR_TIM14    0x40002000

#define _MMIO_ADDR_RTC      0x40002800

#define _MMIO_ADDR_IWDG     0x40003000
#define _MMIO_ADDR_WWDG     0x40002C00

#define _MMIO_ADDR_FSMC     0xA0000000 

#define _MMIO_ADDR_SDIO     0x40018000

#define _MMIO_ADDR_USB_FS   0x40006000 

#define _MMIO_ADDR_bxCAN1   0x40006400 
#define _MMIO_ADDR_bxCAN2   0x40006800

#define _MMIO_ADDR_SPI1     0x40013000
#define _MMIO_ADDR_SPI2     0x40003800
#define _MMIO_ADDR_SPI3     0x40003C00

#define _MMIO_ADDR_I2C1     0x40005400
#define _MMIO_ADDR_I2C2     0x40005800 

#define _MMIO_ADDR_USART1   0x40013800
#define _MMIO_ADDR_USART2   0x40004400
#define _MMIO_ADDR_USART3   0x40004800
#define _MMIO_ADDR_UART4    0x40004C00
#define _MMIO_ADDR_UART5    0x40005000

#define _MMIO_ADDR_USB_OTG  0x50000000

#define _MMIO_ADDR_ETHERNET 0x40028000 



#define _MMIO_ADDR_SRAM_CAN_USB 0x40005C00
#define _MMIO_ADDR_FLASH    0x40022000 

#endif